# Most Polluted Countries - Limpieza de Datos

### · Antes de empezar...

1. Para gestionar los Dataframes:

In [2]:
#Para mi doc de Pipeline:

import sys 
sys.path.append("../SRC") 
import support as sp

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
from collections import Counter
from fuzzywuzzy import process, fuzz
import pickle

/Users/paulaelizagarate/opt/anaconda3/envs/Bootcamp/lib/python3.9/site-packages/fuzzywuzzy/fuzz.py:11: UserWarning: Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning
  warnings.warn('Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning')

###  · Carga de CSVs

Empezamos cargando datos CSV procedentes de Kaggle con la información de los países y las ciudades más contaminadas desde 2017 hasta 2021.

In [4]:
cof17= pd.read_csv("../data/cof/costliving_2017.csv")
cof17.head(5)

   Unnamed: 0    countries  cost_living_index
0           0      Bermuda              146.2
1           1  Switzerland              122.1
2           2      Iceland              111.7
3           3       Norway              106.3
4           4      Bahamas              104.0

In [5]:
cof17["Unnamed: 0"]

0        0
1        1
2        2
3        3
4        4
      ...
116    116
117    117
118    118
119    119
120    120
Name: Unnamed: 0, Length: 121, dtype: int64

In [6]:
col17= ["countries", "cost_living_index"]

In [7]:
cof17= cof17[col17]
cof17

       countries  cost_living_index
0        Bermuda              146.2
1    Switzerland              122.1
2        Iceland              111.7
3         Norway              106.3
4        Bahamas              104.0
..           ...                ...
116      Georgia               27.4
117     Pakistan               27.2
118      Ukraine               26.2
119        India               25.1
120        Egypt               22.4

[121 rows x 2 columns]

In [8]:
def minusculas (x):
    x= [i.lower() for i in x]
    return(x)

In [9]:
cof17["countries"]= minusculas(cof17["countries"])

In [10]:
year=["2017"]

year17= year*len(cof17["countries"])

In [11]:
cof17["year"]= year17

cof17["year"]= pd.to_numeric(cof17["year"])

In [12]:
#control de información
#cof17.info()
#cof17

Una vez limpio nuestro DataFrame de coste de vida referente al año 2017, procedemos a limpiar el resto de años:

#### 2018

In [13]:
cof18= pd.read_csv("../data/cof/costliving_2018.csv")
cof18.head(5)

   Unnamed: 0    countries  cost_living_index
0           0      Bermuda              144.9
1           1  Switzerland              131.4
2           2      Iceland              124.0
3           3       Norway              113.7
4           4      Bahamas              100.7

In [14]:
col18= ["countries", "cost_living_index"]
cof18= cof18[col18]

In [15]:
cof18["countries"]= minusculas(cof18["countries"])

In [16]:
year=["2018"]

year18= year*len(cof18["countries"])

In [17]:
cof18["year"]= year18

cof18["year"]= pd.to_numeric(cof18["year"])

In [18]:
#Control de información
#cof18.info()
cof18.head()

     countries  cost_living_index  year
0      bermuda              144.9  2018
1  switzerland              131.4  2018
2      iceland              124.0  2018
3       norway              113.7  2018
4      bahamas              100.7  2018

#### 2019

In [19]:
cof19= pd.read_csv("../data/cof/costliving_2019.csv")
cof19.head(5)

   Unnamed: 0    countries  cost_living_index
0           0  Switzerland              121.2
1           1      Iceland              101.9
2           2       Norway              101.0
3           3      Bahamas               92.4
4           4   Luxembourg               86.1

In [20]:
col19= ["countries", "cost_living_index"]
cof19= cof19[col19]

In [21]:
cof19["countries"]= minusculas(cof19["countries"])

In [22]:
year=["2019"]

year19= year*len(cof19["countries"])

In [23]:
cof19["year"]= year19

cof19["year"]= pd.to_numeric(cof19["year"])

In [24]:
#Control de información
cof19.info()
cof19.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   countries          119 non-null    object
 1   cost_living_index  119 non-null    float64
 2   year               119 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.9+ KB

     countries  cost_living_index  year
0  switzerland              121.2  2019
1      iceland              101.9  2019
2       norway              101.0  2019
3      bahamas               92.4  2019
4   luxembourg               86.1  2019

#### 2020

In [25]:
cof20= pd.read_csv("../data/cof/costliving_2019.csv")
cof20.head(5)

   Unnamed: 0    countries  cost_living_index
0           0  Switzerland              121.2
1           1      Iceland              101.9
2           2       Norway              101.0
3           3      Bahamas               92.4
4           4   Luxembourg               86.1

In [26]:
col20= ["countries", "cost_living_index"]
cof20= cof20[col20]

In [27]:
cof20["countries"]= minusculas(cof20["countries"])

In [28]:
year=["2020"]

year20= year*len(cof20["countries"])

In [29]:
cof20["year"]= year20

cof20["year"]= pd.to_numeric(cof20["year"])

In [30]:
#Control de información
cof20.info()
cof20.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   countries          119 non-null    object
 1   cost_living_index  119 non-null    float64
 2   year               119 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.9+ KB

     countries  cost_living_index  year
0  switzerland              121.2  2020
1      iceland              101.9  2020
2       norway              101.0  2020
3      bahamas               92.4  2020
4   luxembourg               86.1  2020

#### 2021

In [31]:
cof21= pd.read_csv("../data/cof/costliving_2021.csv")
cof21.head(5)

   Unnamed: 0    countries  cost_living_index
0           0      Bermuda              145.1
1           1  Switzerland              131.7
2           2       Norway              106.1
3           3      Iceland               96.8
4           4      Denmark               91.7

In [32]:
col21= ["countries", "cost_living_index"]
cof21= cof21[col21]

In [33]:
cof21["countries"]= minusculas(cof21["countries"])

In [34]:
year=["2021"]

year21= year*len(cof21["countries"])

In [35]:
cof21["year"]= year21

cof21["year"]= pd.to_numeric(cof21["year"])

In [36]:
#Control de información
cof21.info()
cof21.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 138 entries, 0 to 137
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   countries          138 non-null    object
 1   cost_living_index  138 non-null    float64
 2   year               138 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 3.4+ KB

     countries  cost_living_index  year
0      bermuda              145.1  2021
1  switzerland              131.7  2021
2       norway              106.1  2021
3      iceland               96.8  2021
4      denmark               91.7  2021

In [37]:
costevida_total= pd.concat([cof17, cof18, cof19, cof20, cof21], axis=0, ignore_index = True)

In [43]:
costevida_total.to_csv('cost_living.csv')

In [39]:
costevida_total["countries"]

0          bermuda
1      switzerland
2          iceland
3           norway
4          bahamas
          ...
607    afghanistan
608          india
609     kyrgyzstan
610          libya
611       pakistan
Name: countries, Length: 612, dtype: object

In [45]:
costevida_total.tail(20)

                       countries  cost_living_index  year
592                   azerbaijan               30.9  2021
593                     paraguay               30.7  2021
594                      belarus               30.7  2021
595                        egypt               30.1  2021
596                   kazakhstan               29.8  2021
597                      nigeria               29.7  2021
598                      tunisia               29.5  2021
599  kosovo (disputed territory)               29.4  2021
600                      ukraine               29.2  2021
601                        syria               29.0  2021
602                        nepal               28.9  2021
603                      algeria               28.3  2021
604                       zambia               28.1  2021
605                      georgia               28.0  2021
606                   uzbekistan               27.1  2021
607                  afghanistan               26.3  2021
608                        india               25.2  2021
609                   kyrgyzstan               23.0  2021
610                        libya               22.3  2021
611                     pakistan               21.6  2021

In [41]:
costevida_total.isnull().sum()

countries            0
cost_living_index    0
year                 0
dtype: int64

In [42]:
costevida_total.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 612 entries, 0 to 611
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   countries          612 non-null    object
 1   cost_living_index  612 non-null    float64
 2   year               612 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 14.5+ KB